/**
     * 筛选服务配置JS文件
     *
     */
// X-Bond的为1，做市报价为2，全市场行情为3，做市成交为4，空元素则不带前缀发送
var G_SEND_FLAGS = [{ key: '' }];
// 过滤器发送给框架的方法名
var G_SEND_METHOD = 'CommFilterSearchConditon_HQGrid';
// 首次进入时，是否清除上次所选
var G_CLEAR_CACHE_ON_ENTRY = true;
// 筛选数据配置
// custom: 是否支持输入
// plus: 是否为正
var G_FILTER_DATA = [
    [
        ["现价", "6", {custom: 1, plus: 1}],
        ["<3", "3)"],
        ["≥100", "[100"],
    ],
    [
        ["涨幅", "14", {custom: 1}],
        ["2 - 5", "[2_5]"],
        ["≥7", "[7"],
        ["<-7", "-7)"],
    ],
    [
        ["10日涨幅", "210", {custom: 1}],
        ["≥20", "[20"],
        ["<-10", "-10)"],
    ],
    [
        ["量比", "35", {custom: 1, plus: 1}],
        ["≥3", "[3"],
    ],
    [
        ["换手", "36", {custom: 1}],
        ["≥20", "[20"],
    ],
    [
        ["涨速", "46", {custom: 1}],
        ["≥1.5", "[1.5"],
        ["≥3", "[3"],
        ["<-1.5", "-1.5)"],
    ],
    [
        ["量涨速", "208", {custom: 1}],
        ["≥3", "[3"],
    ],
    [
        ["委比", "18", {custom: 1}],
        ["≥70", "[70"],
        ["<-70", "-70)"],
    ],
    [
        ["成交额", "10", {custom: 1, plus: 1}],
        ["≥10亿", "[10"],
    ],
    [
        ["昨成交额", "297", {custom: 1, plus: 1}],
        ["≥10亿", "[10"],
    ],
    [
        ["主力净额", "212", {custom: 1}],
        ["≥2亿", "[2"],
        ["<-2亿", "-2)"],
    ],
    [
        ["分钟主力净额", "218", {custom: 1}],
        ["≥0.5亿", "[0.5"],
        ["<-0.5亿", "-0.5)"],
    ],
    [
        ["封单额", "28", {custom: 1}],
        [">0", "(0"],
        ["<0", "0)"],
    ],
    [
        ["开盘涨幅", "281", {custom: 1}],
        ["≥7", "[7"],
        ["<-7", "-7)"],
    ],
    [
        ["开盘成交额", "29", {custom: 1}],
        ["≥0.1亿", "[0.1"],
    ],
    [
        ["流通市值", "38", {custom: 1}],
        ["≥300亿", "[300"],
        ["<20亿", "20)"],
    ],
    [
        ["市盈(动)", "17", {custom: 1}],
        ["<30", "30)"],
    ],
];